# IFCProductWrapper Properties

---
The IFCProductWrapper type exposes the following members.
| Name| Description
---|---|---
| Count|  The number of objects associated with the IfcProduct in this wrapper.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
IFCProductWrapper Class
Autodesk.Revit.DB.IFC Namespace